import Step1 from './img/1-step.svg';
import Step2 from './img/2-step.svg';
import Step3 from './img/3-step.svg';
import Step4 from './img/4-step.svg';
import Step5 from './img/5-step.svg';

export const data = [
  {
    id: 1,
    image: Step1,
    name: '1. Анализ',
    title: 'Для того, чтобы онлайн-магазин приносил выгоду, перед его запуском необходимо провести анализ других предложений рынка, оценить конкурентов и найти наиболее удобное решение.',
  },
  {
    id: 2,
    image: Step2,
    name: '2. Визуальное решение',
    title: 'Разработка дизайна ключевых страниц магазина – главная, каталог, информационные разделы, раздел корзины, товаров. Для нас главное – передать настроение бренда, сделать удобный сайт.',
  },
  {
    id: 3,
    image: Step3,
    name: '3. Техническая реализация',
    title: 'После утверждения дизайн-макета наступает следующий этап – верстка. Это трудоемкий процесс: программисты должны все тщательно прописать, чтобы не допустить технических ошибок.',
  },
  {
    id: 4,
    image: Step4,
    name: '4. Наполнение контентом ',
    title: 'Создание и публикация текстов, а также видео материала. Хороший контент и качественные фотографии привлекают больше посетителей и помогают клиенту лучше ознакомиться с ассортиментом.',
  },
  {
    id: 5,
    image: Step5,
    name: '5. Тестирование',
    title: 'Составление плана тестирования для определения ошибок. Проверка работы сайта и визуального восприятия для улучшения сайта. Также используются чек-листы для четкого определения ошибок и их устранения.',
  },
];
